; domain
(define (domain warehouse-logistics)
    
    (:types
        object packing_station robot box cell
    )
    
    (:predicates
        (edge ?cell ?cell)
        (station ?cell ?packing_station)
        
        (occupied_ground ?cell)
        (occupied_air ?cell)
        (on ?robot ?cell)
        (over ?robot ?cell)
        (at ?box ?cell)
                               
        (keep ?robot ?box)
        (free_arms ?robot)
        (packed ?box)
    )
    
    (:action move
        :parameters 
            (?robot
             ?from 
             ?to)

        :precondition 
            (and 
                (on ?robot ?from)
                (edge ?from ?to)
                (not (occupied_ground ?to))
            )

        :effect 
            (and 
                (on ?robot ?to)
                (not (on ?robot ?from))
                (occupied_ground ?to)
                (not (occupied_ground ?from))
            )
    )
    
    (:action fly
        :parameters 
            (?robot
             ?from
             ?to)

        :precondition 
            (and 
                (over ?robot ?from)
                (edge ?from ?to)
                (not (occupied_air ?to))
            )

        :effect 
            (and 
                (over ?robot ?to)
                (not (over ?robot ?from))
                (occupied_air ?to)
                (not (occupied_air ?from))
            )
    )
    
    (:action takeoff
        :parameters 
            (?robot
             ?position)

        :precondition 
            (and 
                (on ?robot ?position)
                (not (occupied_air ?position))
            )

        :effect 
            (and 
                (over ?robot ?position)
                (not (on ?robot ?position))
                (occupied_air ?position)
                (not (occupied_ground ?position))
            )
    )
    
    (:action land
        :parameters 
            (?robot
             ?position)

        :precondition 
            (and 
                (over ?robot ?position)
                (not (occupied_ground ?position))
            )

        :effect 
            (and 
                (on ?robot ?position)
                (not (over ?robot ?position))
                (occupied_ground ?position)
                (not (occupied_air ?position))
            )
    )
    
    (:action take
        :parameters
            (?robot
             ?box
             ?robot_position
             ?box_position)
        
        :precondition 
            (and 
                (edge ?robot_position ?box_position)
                (on ?robot ?robot_position)
                (at ?box ?box_position)
                (free_arms ?robot)
            )
            
        :effect 
            (and 
                (not (at ?box ?box_position))
                (not (free_arms ?robot))
                (not (occupied_ground ?box_position))
                (keep ?robot ?box)
            )
    )
    
    (:action put_on_ground
        :parameters
            (?robot
             ?box
             ?robot_position
             ?box_position)
        
        :precondition 
            (and 
                (edge ?robot_position ?box_position)
                (on ?robot ?robot_position)
                (not (occupied_ground ?box_position))
                (keep ?robot ?box)
                (not (free_arms ?robot)) ;; maybe without it
            )
            
        :effect 
            (and 
                (at ?box ?box_position)
                (occupied_ground ?box_position)
                (free_arms ?robot)
                (not (keep ?robot ?box))
            )
    )
    
    (:action pack
        :parameters
            (?robot
             ?box
             ?robot_position
             ?station)
        
        :precondition 
            (and 
                (station ?robot_position ?station)
                (on ?robot ?robot_position)
                (keep ?robot ?box)
                (not (free_arms ?robot)) ;;maybe without it
            )
            
        :effect 
            (and 
                (packed ?box)
                (free_arms ?robot)
                (not (keep ?robot ?box))
            )
    )
)

; problem
(define (problem minecraft-tower)

    (:domain 
        warehouse-logistics    
    )
    
    (:objects
        robot - object
        box - object
        cell - object
        packing_station - object
        
        r1 - robot
        r2 - robot
        
        b1 b2 b3 b4 b5 b6 b7 - box
        
        c00 c01 c02 c03
        c10 c11 c12 c13 
        c20 c21 c22 c23  
        c30 c31 c32 c33 - cell
        
        ps1 ps2 - packing_station
    )

    
    (:init
        (edge c00 c01) (edge c00 c10)
        (edge c01 c00) (edge c01 c02) (edge c01 c11)
        (edge c02 c01) (edge c02 c03) (edge c02 c12)
        (edge c03 c02) (edge c03 c13)
        (edge c10 c00) (edge c10 c11) (edge c10 c20)
        (edge c11 c01) (edge c11 c10) (edge c11 c12) (edge c11 c21)
        (edge c12 c02) (edge c12 c11) (edge c12 c13) (edge c12 c22)
        (edge c13 c03) (edge c13 c12) (edge c13 c23)
        (edge c20 c10) (edge c20 c21) (edge c20 c30)
        (edge c21 c11) (edge c21 c20) (edge c21 c22) (edge c21 c31)
        (edge c22 c12) (edge c22 c21) (edge c22 c23) (edge c22 c32)
        (edge c23 c13) (edge c23 c22) (edge c23 c33)
        (edge c30 c20) (edge c30 c31) 
        (edge c31 c21) (edge c31 c30) (edge c31 c32) 
        (edge c32 c22) (edge c32 c31) (edge c32 c33) 
        (edge c33 c23) (edge c33 c32) 
        
        (station c03 ps1)
        (station c33 ps2)
        
        (on r1 c00)
        (on r2 c33)
        (at b1 c01)
        (at b2 c10)
        (at b3 c02)
        (at b4 c22)
        (at b5 c12)
        (at b6 c30)
        (at b7 c03)
        (occupied_ground c00)
        (occupied_ground c33)
        (occupied_ground c01)
        (occupied_ground c10)
        (occupied_ground c02)
        (occupied_ground c22)
        (occupied_ground c12)
        (occupied_ground c30)
        (occupied_ground c03)
        
        (free_arms r1)
        (free_arms r2)
        
    )
    
    (:goal
        (and 
            (packed b1)
            (packed b2)
            (packed b3)
            (packed b4)
            (packed b5)
            (packed b6)
            (packed b7)
            
        )
    )
)

; plan
1. (take r1 b2 c00 c10)
   deleted: (at b2 c10) (free_arms r1) (occupied_ground c10)
   added: (keep r1 b2)
   goals met: 0 of 7
2. (move r2 c33 c32)
   deleted: (on r2 c33) (occupied_ground c33)
   added: (on r2 c32) (occupied_ground c32)
   goals met: 0 of 7
3. (take r2 b4 c32 c22)
   deleted: (at b4 c22) (free_arms r2) (occupied_ground c22)
   added: (keep r2 b4)
   goals met: 0 of 7
4. (move r2 c32 c33)
   deleted: (on r2 c32) (occupied_ground c32)
   added: (on r2 c33) (occupied_ground c33)
   goals met: 0 of 7
5. (pack r2 b4 c33 ps2)
   deleted: (keep r2 b4)
   added: (packed b4) (free_arms r2)
   goals met: 1 of 7
6. (move r2 c33 c23)
   deleted: (on r2 c33) (occupied_ground c33)
   added: (on r2 c23) (occupied_ground c23)
   goals met: 1 of 7
7. (move r2 c23 c13)
   deleted: (on r2 c23) (occupied_ground c23)
   added: (on r2 c13) (occupied_ground c13)
   goals met: 1 of 7
8. (take r2 b7 c13 c03)
   deleted: (at b7 c03) (free_arms r2) (occupied_ground c03)
   added: (keep r2 b7)
   goals met: 1 of 7
9. (move r2 c13 c03)
   deleted: (on r2 c13) (occupied_ground c13)
   added: (on r2 c03) (occupied_ground c03)
   goals met: 1 of 7
10. (pack r2 b7 c03 ps1)
   deleted: (keep r2 b7)
   added: (packed b7) (free_arms r2)
   goals met: 2 of 7
11. (take r2 b3 c03 c02)
   deleted: (at b3 c02) (free_arms r2) (occupied_ground c02)
   added: (keep r2 b3)
   goals met: 2 of 7
12. (pack r2 b3 c03 ps1)
   deleted: (keep r2 b3)
   added: (packed b3) (free_arms r2)
   goals met: 3 of 7
13. (put_on_ground r1 b2 c00 c10)
   deleted: (keep r1 b2)
   added: (at b2 c10) (occupied_ground c10) (free_arms r1)
   goals met: 3 of 7
14. (move r2 c03 c13)
   deleted: (on r2 c03) (occupied_ground c03)
   added: (on r2 c13) (occupied_ground c13)
   goals met: 3 of 7
15. (take r2 b5 c13 c12)
   deleted: (at b5 c12) (free_arms r2) (occupied_ground c12)
   added: (keep r2 b5)
   goals met: 3 of 7
16. (move r2 c13 c03)
   deleted: (on r2 c13) (occupied_ground c13)
   added: (on r2 c03) (occupied_ground c03)
   goals met: 3 of 7
17. (pack r2 b5 c03 ps1)
   deleted: (keep r2 b5)
   added: (packed b5) (free_arms r2)
   goals met: 4 of 7
18. (move r2 c03 c02)
   deleted: (on r2 c03) (occupied_ground c03)
   added: (on r2 c02) (occupied_ground c02)
   goals met: 4 of 7
19. (take r2 b1 c02 c01)
   deleted: (at b1 c01) (free_arms r2) (occupied_ground c01)
   added: (keep r2 b1)
   goals met: 4 of 7
20. (move r2 c02 c03)
   deleted: (on r2 c02) (occupied_ground c02)
   added: (on r2 c03) (occupied_ground c03)
   goals met: 4 of 7
21. (pack r2 b1 c03 ps1)
   deleted: (keep r2 b1)
   added: (packed b1) (free_arms r2)
   goals met: 5 of 7
22. (take r1 b2 c00 c10)
   deleted: (at b2 c10) (free_arms r1) (occupied_ground c10)
   added: (keep r1 b2)
   goals met: 5 of 7
23. (move r1 c00 c01)
   deleted: (on r1 c00) (occupied_ground c00)
   added: (on r1 c01) (occupied_ground c01)
   goals met: 5 of 7
24. (put_on_ground r1 b2 c01 c02)
   deleted: (keep r1 b2)
   added: (at b2 c02) (occupied_ground c02) (free_arms r1)
   goals met: 5 of 7
25. (take r2 b2 c03 c02)
   deleted: (at b2 c02) (free_arms r2) (occupied_ground c02)
   added: (keep r2 b2)
   goals met: 5 of 7
26. (pack r2 b2 c03 ps1)
   deleted: (keep r2 b2)
   added: (packed b2) (free_arms r2)
   goals met: 6 of 7
27. (move r1 c01 c11)
   deleted: (on r1 c01) (occupied_ground c01)
   added: (on r1 c11) (occupied_ground c11)
   goals met: 6 of 7
28. (move r1 c11 c21)
   deleted: (on r1 c11) (occupied_ground c11)
   added: (on r1 c21) (occupied_ground c21)
   goals met: 6 of 7
29. (move r1 c21 c31)
   deleted: (on r1 c21) (occupied_ground c21)
   added: (on r1 c31) (occupied_ground c31)
   goals met: 6 of 7
30. (take r1 b6 c31 c30)
   deleted: (at b6 c30) (free_arms r1) (occupied_ground c30)
   added: (keep r1 b6)
   goals met: 6 of 7
31. (takeoff r2 c03)
   deleted: (on r2 c03) (occupied_ground c03)
   added: (over r2 c03) (occupied_air c03)
   goals met: 6 of 7
32. (move r1 c31 c32)
   deleted: (on r1 c31) (occupied_ground c31)
   added: (on r1 c32) (occupied_ground c32)
   goals met: 6 of 7
33. (move r1 c32 c33)
   deleted: (on r1 c32) (occupied_ground c32)
   added: (on r1 c33) (occupied_ground c33)
   goals met: 6 of 7
34. (pack r1 b6 c33 ps2)
   deleted: (keep r1 b6)
   added: (packed b6) (free_arms r1)
   goals met: 7 of 7
